In [8]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])

In [7]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [10]:
obj2.index

Index([u'a', u'b', u'c', u'd'], dtype='object')

In [11]:
obj2['c']

-5

In [12]:
obj2[['c', 'b', 'a']]

c   -5
b    7
a    4
dtype: int64

In [13]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [15]:
obj2[obj2 > 4]

b    7
dtype: int64

In [16]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [19]:
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

In [20]:
'b' in obj2

True

In [21]:
'e' in obj2

False

In [22]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
obj3 = Series(sdata)

In [24]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [25]:
obj3.index

Index([u'Ohio', u'Oregon', u'Texas', u'Utah'], dtype='object')

In [26]:
obj3.index = ['Oh', 'Or', 'Te', 'Ut']

In [27]:
obj3

Oh    35000
Or    16000
Te    71000
Ut     5000
dtype: int64

In [28]:
obj3.index

Index([u'Oh', u'Or', u'Te', u'Ut'], dtype='object')

In [32]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [33]:
obj4 = Series(sdata, index=states)

In [34]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [35]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [36]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [37]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [38]:
obj3

Oh    35000
Or    16000
Te    71000
Ut     5000
dtype: int64

In [39]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
sdata

{'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

In [41]:
obj3 = Series(sdata)

In [42]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [43]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [44]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [45]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [47]:
obj4.name = 'population'

In [48]:
obj4.index.name = 'state'

In [49]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [50]:
obj4.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [51]:
obj4

Bob          NaN
Steve    35000.0
Jeff     16000.0
Ryan     71000.0
Name: population, dtype: float64

In [52]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [53]:
frame = DataFrame(data)

In [54]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [55]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [57]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [58]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [59]:
frame2.shape

(5, 4)

In [60]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [61]:
frame2.index

Index([u'one', u'two', u'three', u'four', u'five'], dtype='object')

In [62]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [63]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [64]:
frame2.ix['three']

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [65]:
frame2.debt = 16.5

In [66]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [69]:
frame2['debt'] = 16.5

In [70]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [71]:
frame2.debt = np.arange(5.)

In [72]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [74]:
frame2.debt

one      0.0
two      1.0
three    2.0
four     3.0
five     4.0
Name: debt, dtype: float64

In [75]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [76]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'three', 'four'])

In [77]:
frame2.debt = val

In [78]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6  -1.5
four   2001  Nevada  2.4  -1.7
five   2002  Nevada  2.9   NaN

In [79]:
frame2['eastern'] = frame2.state == 'Ohio'

In [80]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN     NaN
two    2001    Ohio  1.7  -1.2     NaN
three  2002    Ohio  3.6  -1.5     NaN
four   2001  Nevada  2.4  -1.7     NaN
five   2002  Nevada  2.9   NaN     NaN

In [82]:
del frame2['eastern']

In [83]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6  -1.5
four   2001  Nevada  2.4  -1.7
five   2002  Nevada  2.9   NaN

In [84]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [85]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [86]:
frame3 = DataFrame(pop)

In [87]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [88]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [89]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [90]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [91]:
pdata={'Ohio': frame3['Ohio'][:-1],
      'Nevada':frame3['Nevada'][:2]}

In [92]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [93]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [94]:
frame3.index.name = 'year';frame3.columns.name = 'state'

In [95]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [96]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [97]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [98]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [99]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [100]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6  -1.5
four   2001  Nevada  2.4  -1.7
five   2002  Nevada  2.9   NaN

In [101]:
frame2.values

array([[2000L, 'Ohio', 1.5, nan],
       [2001L, 'Ohio', 1.7, -1.2],
       [2002L, 'Ohio', 3.6, -1.5],
       [2001L, 'Nevada', 2.4, -1.7],
       [2002L, 'Nevada', 2.9, nan]], dtype=object)

In [102]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [103]:
obj

a    0
b    1
c    2
dtype: int64

In [105]:
obj.index

Index([u'a', u'b', u'c'], dtype='object')

In [106]:
index = obj.index

In [107]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [108]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [109]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [110]:
index = pd.Index(np.arange(3))

In [111]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [112]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [113]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [114]:
obj2.index is index

True

In [115]:
obj2.index == index

array([ True,  True,  True], dtype=bool)

In [116]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [117]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [118]:
frame3.columns

Index([u'Nevada', u'Ohio'], dtype='object', name=u'state')

In [120]:
'Ohio' in frame3.columns

True

In [121]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64', name=u'year')

In [122]:
2003 in frame3.index

False

In [123]:
frame2.index

Index([u'one', u'two', u'three', u'four', u'five'], dtype='object')

In [124]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [126]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [127]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [128]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [129]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [130]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [131]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [132]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [133]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [134]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [135]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [137]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [138]:
frame = DataFrame(np.arange(9).reshape(3, 3), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [139]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [140]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [141]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [145]:
states = ['Texas', 'Utah', 'California']

In [146]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [150]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [154]:
states

['Texas', 'Utah', 'California']

In [156]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [161]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [162]:
#丢弃指定轴上的项

In [164]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [165]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [166]:
new_obj = obj.drop('c')

In [167]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [168]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [169]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [170]:
obj.drop(['a', 'd'])

b    1.0
c    2.0
e    4.0
dtype: float64

In [171]:
data = DataFrame(np.arange(16).reshape(4, 4), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [172]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [173]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [175]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [176]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [178]:
data.drop(['one', 'four'], axis=1)

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [179]:
# 索引，选取和过滤
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [180]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [181]:
obj['a']

0.0

In [182]:
obj[0]

0.0

In [183]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [187]:
obj[['a', 'b', 'c']]

a    0.0
b    1.0
c    2.0
dtype: float64

In [188]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [191]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [192]:
obj < 2

a     True
b     True
c    False
d    False
dtype: bool

In [193]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [194]:
obj['b':'c'] = 5

In [195]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [196]:
data = DataFrame(np.arange(16).reshape(4, 4), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [197]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [198]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [201]:
data[['one', 'two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [202]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [204]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [203]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [205]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [206]:
data[data < 5] = 0

In [207]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [208]:
data.ix['Colorado', ['two', 'four']]

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

two     5
four    7
Name: Colorado, dtype: int32

In [209]:
data.ix[['New York', 'Ohio'], ['one', 'four']]

          one  four
New York   12    15
Ohio        0     0

In [212]:
data.ix[['New York', 'Utah'], [3, 0, 1]]

          four  one  two
New York    15   12   13
Utah        11    8    9

In [211]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [213]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [214]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [215]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [216]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [219]:
data.ix[:2]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7

In [220]:
data.ix['Ohio':'New York']

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [221]:
# 算术运算和数据对齐
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [223]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [224]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [225]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [230]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [231]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [232]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [233]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [235]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [237]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [238]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [239]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [240]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [241]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [242]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [243]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [245]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [246]:
df2.add(df1, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [247]:
df2.sub(df1)

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1  1.0  1.0  1.0  1.0 NaN
2  2.0  2.0  2.0  2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [248]:
arr = np.arange(12.).reshape((3, 4))

In [249]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [250]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [251]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [252]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [253]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [255]:
series = frame.ix['Utah']

In [256]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [257]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [258]:
series2 = Series(range(3), index=list('bef'))

In [259]:
series2

b    0
e    1
f    2
dtype: int64

In [260]:
frame - series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [261]:
series3 = frame['d']

In [262]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [263]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [264]:
# 函数应用和映射
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [265]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [266]:
frame

               b         d         e
Utah   -1.700595 -0.935082 -0.249153
Ohio    1.315875 -0.140363  0.348973
Texas   0.983516 -1.439222  0.422426
Oregon  0.278314  1.076331  0.803206

In [267]:
np.abs(frame)

               b         d         e
Utah    1.700595  0.935082  0.249153
Ohio    1.315875  0.140363  0.348973
Texas   0.983516  1.439222  0.422426
Oregon  0.278314  1.076331  0.803206

In [268]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    3.016471
d    2.515553
e    1.052359
dtype: float64

In [269]:
frame.apply(f, axis=1)

Utah      1.451443
Ohio      1.456238
Texas     2.422738
Oregon    0.798017
dtype: float64

In [270]:
frame

               b         d         e
Utah   -1.700595 -0.935082 -0.249153
Ohio    1.315875 -0.140363  0.348973
Texas   0.983516 -1.439222  0.422426
Oregon  0.278314  1.076331  0.803206

In [275]:
frame.mean(1)

Utah     -0.961610
Ohio      0.508162
Texas    -0.011093
Oregon    0.719284
dtype: float64

In [276]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [277]:
frame.apply(f)

            b         d         e
min -1.700595 -1.439222 -0.249153
max  1.315875  1.076331  0.803206

In [278]:
format = lambda x : '%.2f' % x

In [279]:
frame.applymap(format)

            b      d      e
Utah    -1.70  -0.94  -0.25
Ohio     1.32  -0.14   0.35
Texas    0.98  -1.44   0.42
Oregon   0.28   1.08   0.80

In [280]:
frame['e'].map(format)

Utah      -0.25
Ohio       0.35
Texas      0.42
Oregon     0.80
Name: e, dtype: object

In [281]:
# 排序和排名
obj = Series(range(4), index=list('dabc'))

In [282]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [285]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [286]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [287]:
frame

               b         d         e
Utah   -1.700595 -0.935082 -0.249153
Ohio    1.315875 -0.140363  0.348973
Texas   0.983516 -1.439222  0.422426
Oregon  0.278314  1.076331  0.803206

In [311]:
frame = DataFrame(np.arange(8).reshape(2, 4), index=['Three', 'One'], columns=list('dabc'))

In [312]:
frame

       d  a  b  c
Three  0  1  2  3
One    4  5  6  7

In [313]:
frame.sort_index()

       d  a  b  c
One    4  5  6  7
Three  0  1  2  3

In [314]:
frame.sort_index(axis=1)

       a  b  c  d
Three  1  2  3  0
One    5  6  7  4

In [315]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
Three  0  3  2  1
One    4  7  6  5

In [316]:
obj = Series([4, 7, -3, 2])

In [317]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [320]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [321]:
frame = DataFrame({'b': [4, 7, -3 ,2], 'a': [0, 1, 0, 1]})

In [322]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [323]:
frame.sort_index(by='b')

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [324]:
frame.sort_index(by=['a', 'b'])

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [325]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [327]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [328]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [329]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [330]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [331]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [333]:
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [335]:
obj.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [336]:
obj = Series(range(5), index=list('aabbc'))

In [337]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [339]:
obj.index.is_unique

False

In [340]:
obj['a']

a    0
a    1
dtype: int64

In [341]:
obj.a

a    0
a    1
dtype: int64

In [342]:
obj['c']

4

In [343]:
frame = DataFrame(np.random.randn(4, 3), index=list('aabb'))

In [344]:
frame

          0         1         2
a  1.427915 -1.468687 -1.057327
a -1.500820 -1.613325  0.539779
b -1.355486  1.060429  1.250952
b -0.766151 -0.716834 -0.275435

In [346]:
frame.ix['b']

          0         1         2
b -1.355486  1.060429  1.250952
b -0.766151 -0.716834 -0.275435

In [347]:
df = DataFrame([[1.4, np.nan] , [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=list('abcd'), columns=['one', 'two'])

In [348]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [349]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [350]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [351]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [352]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [353]:
df.idxmin()

one    d
two    b
dtype: object

In [354]:
df.idxmin(axis=1)

a    one
b    two
c    NaN
d    two
dtype: object

In [355]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [357]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [358]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [359]:
df.cumsum(axis=1)

    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [361]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [360]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [362]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [363]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [365]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [366]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [367]:
df.count()

one    3
two    2
dtype: int64

In [368]:
df.min()

one    0.75
two   -4.50
dtype: float64

In [371]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [372]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [17]:
df.cummin()

NameError: name 'df' is not defined

In [48]:
# 相关系数与协方差
import pandas_datareader.data as web
from datetime import datetime

all_data = {}
start = datetime(2000, 1, 1)
end = datetime(2010, 1, 1)
for ticker in ['APPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.DataReader(ticker, 'google', start, end)

ConnectionError: HTTPConnectionPool(host='www.google.com', port=80): Max retries exceeded with url: /finance/historical?q=APPL&startdate=Jan+01%2C+2000&enddate=Jan+01%2C+2010&output=csv (Caused by NewConnectionError('<urllib3.connection.HTTPConnection object at 0x000000000BFC2780>: Failed to establish a new connection: [Errno 10060] ',))

In [33]:
price = DataFrame({tic: data['Adj Close']
                      for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                       for tic, data in all_data.iteritems()})

KeyError: 'Volume'

In [49]:
frame = DataFrame(np.random.randn(10, 4), index=list('abcdefghij'), columns=['APPL', 'GOOG', 'IBM', 'MSFT'])

In [50]:
frame

       APPL      GOOG       IBM      MSFT
a -0.469072 -0.341671  0.242247  0.660261
b -1.896230 -0.402782  0.687190  0.770180
c  1.489096  0.482090  0.937979 -1.710139
d -0.961838  0.700842 -0.854585 -0.160731
e -0.323168  1.167057 -1.192786 -0.239069
f -0.528492 -1.502858 -0.707281 -0.470535
g -1.141984 -1.189373 -0.695429 -0.027896
h -0.401721  1.796209  0.550164  0.777688
i  0.572170  0.042692 -0.088177  1.440637
j -0.105607  0.805497  0.908116  1.001516

In [51]:
frame.pct_change()

       APPL       GOOG        IBM       MSFT
a       NaN        NaN        NaN        NaN
b  3.042517   0.178858   1.836727   0.166479
c -1.785293  -2.196899   0.364949  -3.220441
d -1.645921   0.453759  -1.911091  -0.906013
e -0.664010   0.665220   0.395749   0.487387
f  0.635348  -2.287733  -0.407035   0.968197
g  1.160836  -0.208592  -0.016757  -0.940715
h -0.648226  -2.510215  -1.791115 -28.878303
i -2.424297  -0.976232  -1.160275   0.852462
j -1.184574  17.867419 -11.298747  -0.304811

In [54]:
frame.MSFT.corr(frame.IBM)

0.1703534729748904

In [55]:
frame.MSFT.cov(frame.IBM)

0.12372988178487067

In [56]:
frame.corr()

          APPL      GOOG       IBM      MSFT
APPL  1.000000  0.294699  0.288047 -0.344772
GOOG  0.294699  1.000000  0.234894  0.109650
IBM   0.288047  0.234894  1.000000  0.170353
MSFT -0.344772  0.109650  0.170353  1.000000

In [57]:
frame.cov()

          APPL      GOOG       IBM      MSFT
APPL  0.858569  0.283078  0.212001 -0.292117
GOOG  0.283078  1.074683  0.193418  0.103941
IBM   0.212001  0.193418  0.630917  0.123730
MSFT -0.292117  0.103941  0.123730  0.836133

In [67]:
frame2 = DataFrame([[1,5],[3,1]], index=list('ab'), columns=['IBM', 'MSFT'])

In [68]:
frame2

   IBM  MSFT
a    1     5
b    3     1

In [69]:
frame2.MSFT.cov(frame2.IBM)

-4.0

In [70]:
obj = Series(list('cadaabbcc'))

In [71]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [72]:
uniques = obj.unique()

In [73]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [74]:
uniques.sort()

In [75]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [76]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [78]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [79]:
pd.value_counts([1,2 ,1,4,3,4,])

4    2
1    2
3    1
2    1
dtype: int64

In [81]:
pd.value_counts(obj, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [82]:
obj.isin(['b', 'c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [83]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [84]:
data = DataFrame({'Qu1': [1,3,4,3,4],
                 'Qu2': [2,3,1,2,3],
                 'Qu3': [1,5,2,4,4]})

In [85]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [86]:
data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [87]:
result = data.apply(pd.value_counts).fillna(0)

In [88]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [89]:
string_data = Series(['aar', 'arti', np.nan, 'avo'])

In [90]:
string_data

0     aar
1    arti
2     NaN
3     avo
dtype: object

In [91]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [92]:
string_data[0] = None

In [93]:
string_data

0    None
1    arti
2     NaN
3     avo
dtype: object

In [94]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [95]:
string_data.fillna(0)

0       0
1    arti
2       0
3     avo
dtype: object

In [99]:
string_data.fillna(method='ffill')

0    None
1    arti
2    arti
3     avo
dtype: object

In [100]:
from numpy import nan as NA

In [101]:
data = Series([1, NA, 3.5, NA, 7])

In [102]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [103]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [104]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [105]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [106]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])

In [107]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [108]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [109]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [111]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [112]:
data[4] = NA

In [113]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [114]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [115]:
df = DataFrame(np.random.randn(7, 3))

In [116]:
df

          0         1         2
0  0.487166 -0.431196 -1.349808
1 -0.417176 -0.278402  3.472397
2 -0.377801 -1.270559  1.054208
3 -1.218022  1.314805 -1.674862
4 -0.101373 -1.903043  1.616423
5  1.120843 -0.922579  1.709881
6 -1.530933  0.788137 -1.475860

In [122]:
df.ix[:4, 1] = NA;df.ix[:2, 2] = NA

In [123]:
df

          0         1         2
0  0.487166       NaN       NaN
1 -0.417176       NaN       NaN
2 -0.377801       NaN       NaN
3 -1.218022       NaN -1.674862
4 -0.101373       NaN  1.616423
5  1.120843 -0.922579  1.709881
6 -1.530933  0.788137 -1.475860

In [129]:
df.dropna(thresh=3)

          0         1         2
5  1.120843 -0.922579  1.709881
6 -1.530933  0.788137 -1.475860

In [130]:
df

          0         1         2
0  0.487166       NaN       NaN
1 -0.417176       NaN       NaN
2 -0.377801       NaN       NaN
3 -1.218022       NaN -1.674862
4 -0.101373       NaN  1.616423
5  1.120843 -0.922579  1.709881
6 -1.530933  0.788137 -1.475860

In [131]:
df.fillna(0)

          0         1         2
0  0.487166  0.000000  0.000000
1 -0.417176  0.000000  0.000000
2 -0.377801  0.000000  0.000000
3 -1.218022  0.000000 -1.674862
4 -0.101373  0.000000  1.616423
5  1.120843 -0.922579  1.709881
6 -1.530933  0.788137 -1.475860

In [132]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.487166  0.500000       NaN
1 -0.417176  0.500000       NaN
2 -0.377801  0.500000       NaN
3 -1.218022  0.500000 -1.674862
4 -0.101373  0.500000  1.616423
5  1.120843 -0.922579  1.709881
6 -1.530933  0.788137 -1.475860

In [133]:
df

          0         1         2
0  0.487166       NaN       NaN
1 -0.417176       NaN       NaN
2 -0.377801       NaN       NaN
3 -1.218022       NaN -1.674862
4 -0.101373       NaN  1.616423
5  1.120843 -0.922579  1.709881
6 -1.530933  0.788137 -1.475860

In [136]:
df.fillna(0, inplace=True)

In [137]:
df

          0         1         2
0  0.487166  0.000000  0.000000
1 -0.417176  0.000000  0.000000
2 -0.377801  0.000000  0.000000
3 -1.218022  0.000000 -1.674862
4 -0.101373  0.000000  1.616423
5  1.120843 -0.922579  1.709881
6 -1.530933  0.788137 -1.475860

In [138]:
df = DataFrame(np.random.randn(6, 3))

In [139]:
df

          0         1         2
0  0.208031  2.898911 -0.076127
1 -0.477555 -1.213808  0.002701
2 -1.915693 -0.366635 -0.114025
3  0.026954  0.992915 -0.193673
4  0.310399 -0.016252  1.057778
5  0.994128 -0.974114 -0.430898

In [142]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [143]:
df

          0         1         2
0  0.208031  2.898911 -0.076127
1 -0.477555 -1.213808  0.002701
2 -1.915693       NaN -0.114025
3  0.026954       NaN -0.193673
4  0.310399       NaN       NaN
5  0.994128       NaN       NaN

In [144]:
df.fillna(method='ffill')

          0         1         2
0  0.208031  2.898911 -0.076127
1 -0.477555 -1.213808  0.002701
2 -1.915693 -1.213808 -0.114025
3  0.026954 -1.213808 -0.193673
4  0.310399 -1.213808 -0.193673
5  0.994128 -1.213808 -0.193673

In [145]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.208031  2.898911 -0.076127
1 -0.477555 -1.213808  0.002701
2 -1.915693 -1.213808 -0.114025
3  0.026954 -1.213808 -0.193673
4  0.310399       NaN -0.193673
5  0.994128       NaN -0.193673

In [150]:
data = Series([1., NA, 3.5, NA, 7.5])

In [151]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.5
dtype: float64

In [152]:
data.fillna(data.mean())

0    1.0
1    4.0
2    3.5
3    4.0
4    7.5
dtype: float64

In [155]:
#层次化索引
data = Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                                          [1,2,3,1,2,3,1,2,2,3]])

In [156]:
data

a  1   -0.957309
   2   -0.568536
   3    0.589633
b  1    0.017807
   2   -0.822273
   3    0.482499
c  1   -0.842863
   2    0.656618
d  2   -0.681574
   3   -0.935814
dtype: float64

In [157]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [158]:
data['a']

1   -0.957309
2   -0.568536
3    0.589633
dtype: float64

In [159]:
data['c']

1   -0.842863
2    0.656618
dtype: float64

In [160]:
data['b':'c']

b  1    0.017807
   2   -0.822273
   3    0.482499
c  1   -0.842863
   2    0.656618
dtype: float64

In [162]:
data.ix[['b', 'd']]

b  1    0.017807
   2   -0.822273
   3    0.482499
d  2   -0.681574
   3   -0.935814
dtype: float64

In [163]:
data

a  1   -0.957309
   2   -0.568536
   3    0.589633
b  1    0.017807
   2   -0.822273
   3    0.482499
c  1   -0.842863
   2    0.656618
d  2   -0.681574
   3   -0.935814
dtype: float64

In [166]:
data[:, 3]

a    0.589633
b    0.482499
d   -0.935814
dtype: float64

In [167]:
data.unstack()

          1         2         3
a -0.957309 -0.568536  0.589633
b  0.017807 -0.822273  0.482499
c -0.842863  0.656618       NaN
d       NaN -0.681574 -0.935814

In [168]:
data.unstack().stack()

a  1   -0.957309
   2   -0.568536
   3    0.589633
b  1    0.017807
   2   -0.822273
   3    0.482499
c  1   -0.842863
   2    0.656618
d  2   -0.681574
   3   -0.935814
dtype: float64

In [172]:
frame = DataFrame(np.arange(12).reshape(4, 3),
                  index=[['a','a','b','b'], [1,2,1,2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [173]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [174]:
frame.index.names = ['key1', 'key2']

In [175]:
frame.columns.names = ['state', 'color']

In [176]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [179]:
frame.ix['a']

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

state  Ohio     Colorado
color Green Red    Green
key2
1         0   1        2
2         3   4        5

In [184]:
from pandas import MultiIndex 
multi_columns = MultiIndex.from_arrays([['Ohio', 'Ohio', 'ColoradoC'],['Green', 'Red', 'Green']], names=['state', 'color'])

In [185]:
frame.columns = multi_columns

In [186]:
frame

state      Ohio     ColoradoC
color     Green Red     Green
key1 key2
a    1        0   1         2
     2        3   4         5
b    1        6   7         8
     2        9  10        11

In [187]:
frame.swaplevel('key1', 'key2')

state      Ohio     ColoradoC
color     Green Red     Green
key2 key1
1    a        0   1         2
2    a        3   4         5
1    b        6   7         8
2    b        9  10        11

In [188]:
frame

state      Ohio     ColoradoC
color     Green Red     Green
key1 key2
a    1        0   1         2
     2        3   4         5
b    1        6   7         8
     2        9  10        11

In [191]:
frame.sortlevel(1)

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     ColoradoC
color     Green Red     Green
key1 key2
a    1        0   1         2
b    1        6   7         8
a    2        3   4         5
b    2        9  10        11

In [192]:
frame.swaplevel(0, 1)

state      Ohio     ColoradoC
color     Green Red     Green
key2 key1
1    a        0   1         2
2    a        3   4         5
1    b        6   7         8
2    b        9  10        11

In [193]:
frame.swaplevel(0, 1).sortlevel(0)

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     ColoradoC
color     Green Red     Green
key2 key1
1    a        0   1         2
     b        6   7         8
2    a        3   4         5
     b        9  10        11

In [194]:
frame

state      Ohio     ColoradoC
color     Green Red     Green
key1 key2
a    1        0   1         2
     2        3   4         5
b    1        6   7         8
     2        9  10        11

In [195]:
frame.sum(level='key2')

state  Ohio     ColoradoC
color Green Red     Green
key2
1         6   8        10
2        12  14        16

In [199]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [200]:
# 使用DataFrame的列
frame = DataFrame({'a': range(7),
                   'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [202]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [203]:
frame2 = frame.set_index(['c', 'd'])

In [204]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [205]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [206]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [207]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [208]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [209]:
# 其他有关pandas的话题
# 整数索引
ser = Series(np.arange(3.))

In [210]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [213]:
ser[2]

2.0

In [214]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [215]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [216]:
ser2[-1]

2.0

In [217]:
ser.ix[:1]

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
dtype: float64

In [218]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [219]:
ser3

-5    0
 1    1
 3    2
dtype: int64

In [224]:
ser3.iloc[2]

2

In [225]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])

In [226]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [231]:
frame.iloc[:,0]

2    0
0    2
1    4
Name: 0, dtype: int32